     C* D2: data structure alphameric subfields alias shared storage.
     C* Anonymous DS: A=bytes1-3, B=bytes4-6, WHOLE=bytes1-6 (overlaps
     C* both). Writing A/B via MOVEL must be visible through WHOLE.
     I            DS
     I                                        1   3 A
     I                                        4   6 B
     I                                        1   6 WHOLE
     C                     MOVEL'ABC'     A
     C                     MOVEL'DEF'     B
     C           WHOLE     COMP 'ABCDEF'                 10
     C  10                 Z-ADD1         RPGRET
